In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
df = pd.read_csv('zxxz.csv')
df

   a  b  c  s     google
0  2  3  4  5  microsoft
1  a  f  e  t     Amazon
2  4  5  3  6       Uber

In [4]:
df =pd.read_csv('zxxz.csv',header=None)
df

   0  1  2  3          4
0  a  b  c  s     google
1  2  3  4  5  microsoft
2  a  f  e  t     Amazon
3  4  5  3  6       Uber

In [7]:
dd = pd.read_table('zxxz.csv',sep= ',', header = None)
dd

   0  1  2  3          4
0  a  b  c  s     google
1  2  3  4  5  microsoft
2  a  f  e  t     Amazon
3  4  5  3  6       Uber

In [8]:
pd.read_csv('zxxz.csv',header= None, nrows = 2)

   0  1  2  3          4
0  a  b  c  s     google
1  2  3  4  5  microsoft

In [9]:
df

   0  1  2  3          4
0  a  b  c  s     google
1  2  3  4  5  microsoft
2  a  f  e  t     Amazon
3  4  5  3  6       Uber

In [10]:
df.to_csv('mydataOutBro.csv')

In [11]:
import sys

In [12]:
df.to_csv(sys.stdout)

,0,1,2,3,4
0,a,b,c,s,google
1,2,3,4,5,microsoft
2,a,f,e,t,Amazon
3,4,5,3,6,Uber

In [13]:
df.to_csv(sys.stdout,sep=',')

,0,1,2,3,4
0,a,b,c,s,google
1,2,3,4,5,microsoft
2,a,f,e,t,Amazon
3,4,5,3,6,Uber

In [15]:
df.to_csv(sys.stdout,sep='%')

%0%1%2%3%4
0%a%b%c%s%google
1%2%3%4%5%microsoft
2%a%f%e%t%Amazon
3%4%5%3%6%Uber

In [17]:
df.to_csv(sys.stdout,columns=[0,1,2])

,0,1,2
0,a,b,c
1,2,3,4
2,a,f,e
3,4,5,3

In [18]:
url = 'https://docs.python...'